InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючВидовПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторыВидовПродукции</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОписаниеНоменклатурыИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохраняет описание номенклатуры
//
// Параметры:
//   ДанныеОписания    - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
//   СохраненныеДанные - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
Процедура УстановитьОписание(ДанныеОписания, СохраненныеДанные = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеОписания.Номенклатура, Истина);

	Если СохраненныеДанные = Неопределено Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	ЕстьЗаписьВРегистре = НаборЗаписей.Выбран();
	
	Если ЕстьЗаписьВРегистре И СохраненныеДанные = Неопределено Тогда

		Если НаборЗаписей.Количество() Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Номенклатура = ДанныеОписания.Номенклатура;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки <> Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = ДанныеОписания.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке <> Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = ДанныеОписания.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = ДанныеОписания.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения <> Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = ДанныеОписания.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка <> Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = ДанныеОписания.ПотребительскаяУпаковка;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = ДанныеОписания.УпаковкаЧастичногоВыбытия;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КлючВидовПродукции")
			И ДанныеОписания.КлючВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.КлючВидовПродукции = ДанныеОписания.КлючВидовПродукции;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ИдентификаторыВидовПродукции")
			И ДанныеОписания.ИдентификаторыВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(ДанныеОписания.ИдентификаторыВидовПродукции);
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	ИначеЕсли СохраненныеДанные <> Неопределено Тогда

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания);

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки = Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = СохраненныеДанные.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке = Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = СохраненныеДанные.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = СохраненныеДанные.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения = Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = СохраненныеДанные.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка = Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = СохраненныеДанные.ПотребительскаяУпаковка;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = СохраненныеДанные.УпаковкаЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КлючВидовПродукции")
			И ДанныеОписания.КлючВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.КлючВидовПродукции = СохраненныеДанные.КлючВидовПродукции;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ИдентификаторыВидовПродукции")
			И ДанныеОписания.ИдентификаторыВидовПродукции <> Неопределено Тогда
			ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(СохраненныеДанные.ИдентификаторыВидовПродукции);
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания,, "ИдентификаторыВидовПродукции");
		ЗаписьНабора.ИдентификаторыВидовПродукции = Новый ХранилищеЗначения(ДанныеОписания.ИдентификаторыВидовПродукции);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ТребуетВзвешивания")
			И ДанныеОписания.ТребуетВзвешивания = Истина Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
			ЗаписьНабора.КоличествоВПотребительскойУпаковке  = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НаборЗаписей.Количество() = 0 И Не ЕстьЗаписьВРегистре Тогда
		Возврат;
	ИначеЕсли НаборЗаписей.Количество() = 1
		И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючВидовПродукции)
		И Не Метаданные.ОпределяемыеТипы.НаборУпаковокНоменклатурыИС.Тип.СодержитТип(ТипЗнч(НаборЗаписей[0].Номенклатура))
		И НаборЗаписей[0].ИдентификаторыВидовПродукции.Получить() = Неопределено Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	НаборЗаписей.Записать();

КонецПроцедуры

// Данные идентификаторов видов продукции ключа.
// 
// Возвращаемое значение:
//  Структура - Данные ключа видов продукции:
// * ВидПродукцииГИСМТ - Неопределено, Строка - идентификатор вида продукции ГИС МТ
// * ВидПродукцииЕГАИС - Неопределено, Строка - идентификатор вида продукции ЕГАИС
// * ВидПродукцииВЕТИС - Неопределено, Строка - идентификатор вида продукции ВЕТИС
// * ВидПродукцииСАТУРН - Неопределено, Строка - идентификатор вида продукции САТУРН
// * ВидПродукцииЗЕРНО - Неопределено, Строка - идентификатор вида продукции ЗЕРНО
// * ВидПродукцииПеречисление - Неопределено, ПеречислениеСсылка.ВидыПродукцииИС - значение перечисления вид продукции
// * МаркируемаяПродукцияЕГАИС - Неопределено, Булево - признак подакцизной продукции ЕГАИС
// * ДанныеДляУточнения - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы
// * СтрокиИдентификаторов - Массив из Строка - строки идентификаторов списком
//                         - Неопределено
Функция ИдентификаторыВидовПродукцииКлюча() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ИменаПолейКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции();
	Для Каждого ИмяПолеКлюча Из ИменаПолейКлюча Цикл
		ВозвращаемоеЗначение.Вставить(ИмяПолеКлюча,  Неопределено);
	КонецЦикла;
	
	ВозвращаемоеЗначение.Вставить("ВидПродукцииПеречисление",   Неопределено);
	ВозвращаемоеЗначение.Вставить("МаркируемаяПродукцияЕГАИС ", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеДляУточнения",         Неопределено);
	ВозвращаемоеЗначение.Вставить("СтрокиИдентификаторов",      Неопределено);
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Устарел. Следует использовать см. ИдентификаторыВидовПродукцииКлюча
// 
// Возвращаемое значение:
//  см. ИдентификаторыВидовПродукцииКлюча
Функция ИдентикаторыВидовПродукцииКлюча() Экспорт
	
	Возврат ИдентификаторыВидовПродукцииКлюча();
	
КонецФункции

// Заполнить отсутствующие ключи видов продукции по данным идентификаторов видов продукции.
Процедура ЗаполнитьОтсутствующиеКлючиПоИдентификаторамВидовПродукции() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОписаниеНоменклатурыИС.Номенклатура                 КАК Номенклатура,
		|	ОписаниеНоменклатурыИС.ИдентификаторыВидовПродукции КАК ИдентификаторыВидовПродукции
		|ИЗ
		|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|ГДЕ
		|	ОписаниеНоменклатурыИС.КлючВидовПродукции = ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)";
	
	ТаблицаКОбработке = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыПоПолям = Новый Массив;
	ТаблицаКОбработке.Колонки.Добавить("ДанныеИдентификаторов");
	ТаблицаКОбработке.Колонки.Добавить("ВидПродукциПеречисление", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	ТаблицаКОбработке.Колонки.Добавить("КлючВидовПродукции",      Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТаблицаКОбработке.Колонки.Добавить("ЗаполненыИдентификаторыПоПолям", Новый ОписаниеТипов("Булево"));
	ТаблицаКОбработке.Колонки.Добавить("ЗаполненыИдентификаторыСписком", Новый ОписаниеТипов("Булево"));
	
	ИменаПолейКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции();
	ДанныеКешаПоЗначениюПеречисления          = Неопределено;
	ДанныеКешаПоИдентификаторамВидовПродукции = Неопределено;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКОбработке Цикл
		
		СохраненнныеДанныеКлюча = СтрокаТаблицы.ИдентификаторыВидовПродукции.Получить();
		Если СохраненнныеДанныеКлюча = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеИдентификаторов = ИдентификаторыВидовПродукцииКлюча();
		ЗаполнитьЗначенияСвойств(ДанныеИдентификаторов, СохраненнныеДанныеКлюча);
		СтрокаТаблицы.ДанныеИдентификаторов = ДанныеИдентификаторов;
		
		СтрокаТаблицы.ЗаполненыИдентификаторыСписком = ЗначениеЗаполнено(ДанныеИдентификаторов.СтрокиИдентификаторов);
		
		Если СтрокаТаблицы.ЗаполненыИдентификаторыСписком Тогда
			
			ДанныеПоискаКлюча = Новый Массив;
			Для Каждого ИдентификаторВидаПродукции Из ДанныеИдентификаторов.СтрокиИдентификаторов Цикл
				СтрокаДанных = Справочники.КлючиВидовПродукцииИС.СтрокаДанныхПоискаКлючаПоИдентификатору();
				СтрокаДанных.Идентификатор = ИдентификаторВидаПродукции;
				ДанныеПоискаКлюча.Добавить(СтрокаДанных);
			КонецЦикла;
			ДанныеКлючаПоИдентификаторам = Справочники.КлючиВидовПродукцииИС.ДанныеКлючаПоИдентификаторамВидовПродукции(
				ДанныеПоискаКлюча, ДанныеКешаПоИдентификаторамВидовПродукции);
			
			СтрокаТаблицы.КлючВидовПродукции = ДанныеКлючаПоИдентификаторам.КлючВидовПродукции;
		
		Иначе
			
			Для Каждого ИмяПоляКлюча Из ИменаПолейКлюча Цикл
				ЗначениеИдентификатора = ДанныеИдентификаторов[ИмяПоляКлюча];
				Если ЗначениеЗаполнено(ЗначениеИдентификатора) Тогда
					Если ИдентификаторыПоПолям.Найти(ЗначениеИдентификатора) = Неопределено Тогда
						ИдентификаторыПоПолям.Добавить(ЗначениеИдентификатора);
					КонецЕсли;
					СтрокаТаблицы.ЗаполненыИдентификаторыПоПолям = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не СтрокаТаблицы.ЗаполненыИдентификаторыСписком
			И Не СтрокаТаблицы.ЗаполненыИдентификаторыПоПолям
			И ЗначениеЗаполнено(ДанныеИдентификаторов.ВидПродукцииПеречисление) Тогда
			
			СтрокаТаблицы.КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.КлючПоЗначениюПеречисления(
				ДанныеИдентификаторов.ВидПродукцииПеречисление,
				ДанныеКешаПоЗначениюПеречисления,
				ДанныеИдентификаторов.МаркируемаяПродукцияЕГАИС,
				ДанныеИдентификаторов.ДанныеДляУточнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОписанияНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТаблицаКОбработке.ВыгрузитьКолонку("Номенклатура"));
	ВидыПродукцииПоИдентификаторам = Справочники.ВидыПродукцииИС.ВидыПродукцииПоИдентификаторам(ИдентификаторыПоПолям);
	
	Для Каждого СтрокаТаблицы Из ТаблицаКОбработке Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.КлючВидовПродукции) Тогда
			Если СтрокаТаблицы.ЗаполненыИдентификаторыСписком Тогда // Отсутствуют виды продукции по списку
				Продолжить;
			ИначеЕсли Не СтрокаТаблицы.ЗаполненыИдентификаторыПоПолям Тогда // Отсутствует вид продукции по перечислению
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеНоменклатуры = ОписанияНоменклатуры[СтрокаТаблицы.Номенклатура];
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КлючВидовПродукции) Тогда
			
			ОписаниеНоменклатуры.КлючВидовПродукции = СтрокаТаблицы.КлючВидовПродукции;
			
		ИначеЕсли СтрокаТаблицы.ЗаполненыИдентификаторыПоПолям Тогда
			
			ПоляКлюча = Справочники.КлючиВидовПродукцииИС.ПоляКлюча();
			НайденыВидыПродукцииПоПолям = Истина;
			Для Каждого ИмяПоляКлюча Из ИменаПолейКлюча Цикл
				ИдентификаторВидаПродукции = СтрокаТаблицы.ДанныеИдентификаторов[ИмяПоляКлюча];
				Если ЗначениеЗаполнено(ИдентификаторВидаПродукции) Тогда
					ВидПродукции = ВидыПродукцииПоИдентификаторам[ИдентификаторВидаПродукции];
					Если ВидПродукции = Неопределено Тогда // вид продукции по ключу не найден
						НайденыВидыПродукцииПоПолям = Ложь;
						Продолжить;
					КонецЕсли;
					ПоляКлюча[ИмяПоляКлюча] = ВидПродукции;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденыВидыПродукцииПоПолям Тогда
				ОписаниеНоменклатуры.КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.ПолучитьКлюч(ПоляКлюча);
			Иначе
				Продолжить;
			КонецЕсли;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			УстановитьОписание(ОписаниеНоменклатуры);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Ошибка при заполнении отсутствующих ключей по идентификаторам видов продукции:
					       |%'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиПодробно);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
